# GetTransactionName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresAccessor..::..GetTransactionName Method
FailuresAccessor Class See Also
---
Retrieves the name of the transaction for which failures are being processed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string GetTransactionName()
```

Visual Basic
---
```text
Public Function GetTransactionName As String
```

Visual C++
---
```text
public:
String^ GetTransactionName()
```

# ### Return Value
The name of the transaction for which failures are being processed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace